app/Controllers/api/AdminController.php

SELECT `user_id`, `users`.`name`, COUNT(attendances.id) as total_attendance
FROM `attendances`
JOIN `users` ON `users`.`id` = `attendances`.`user_id`
GROUP BY `user_id`, `users`.`name`
ORDER BY `total_attendance` DESC
SELECT `user_id`, `users`.`name`, `checkout_checklist`, `time_out`
FROM `attendances`
JOIN `users` ON `users`.`id` = `attendances`.`user_id`
WHERE `attendance_date` = '2025-07-27'
AND `checkout_checklist` IS NOT NULL
ORDER BY `time_out` DESC
---
    public function dashboardSummary()
    {
        date_default_timezone_set('Asia/Jakarta');
        $db = \Config\Database::connect();

        // 1. Ambil Total Presensi per User
        $attendanceCounts = $db->table('attendances')
            ->select('user_id, users.name, COUNT(attendances.id) as total_attendance')
            ->join('users', 'users.id = attendances.user_id')
            ->groupBy('user_id, users.name')
            ->orderBy('total_attendance', 'DESC')
            ->get()->getResultArray();

        // 2. Ambil Checklist Checkout Hari Ini
        $today = date('Y-m-d');
        $todayChecklists = $db->table('attendances')
            ->select('user_id, users.name, checkout_checklist, time_out')
            ->join('users', 'users.id = attendances.user_id')
            ->where('attendance_date', $today)
            ->where('checkout_checklist IS NOT NULL')
            ->orderBy('time_out', 'DESC')
            ->get()->getResultArray();