app/Controllers/api/AdminController.php

    public function getAllEmployees(){
        $userModel = new UserModel();
        // $adminId = $this->request->user->id; // Contoh jika menggunakan JWT
        // $employees = $userModel->where('id !=', $adminId)->findAll();
        $employees = $userModel->findAll();
---
SELECT *
FROM `users`

    public function getAllAttendanceHistory(){
        $model = new AttendanceModel();
        $history = $model
            ->select('attendances.*, users.name')
            ->join('users', 'users.id = attendances.user_id')
            ->orderBy('attendance_date', 'DESC')
            ->findAll();
---
SELECT `attendances`.*, `users`.`name`
FROM `attendances`
JOIN `users` ON `users`.`id` = `attendances`.`user_id`
ORDER BY `attendance_date` DESC

    public function getAllOvertimeHistory(){
        $model = new OvertimeSubmissionModel();
        $history = $model
            ->select('overtime_submissions.*, users.name')
            ->join('users', 'users.id = overtime_submissions.user_id')
            ->orderBy('start_date', 'DESC')
            ->findAll();
---
SELECT `overtime_submissions`.*, `users`.`name`
FROM `overtime_submissions`
JOIN `users` ON `users`.`id` = `overtime_submissions`.`user_id`
ORDER BY `start_date` DESC

    public function dashboardSummary(){
        date_default_timezone_set('Asia/Jakarta');
        $db = \Config\Database::connect();

        // 1. Ambil Total Presensi per User
        $attendanceCounts = $db->table('attendances')
            ->select('user_id, users.name, COUNT(attendances.id) as total_attendance')
            ->join('users', 'users.id = attendances.user_id')
            ->groupBy('user_id, users.name')
            ->orderBy('total_attendance', 'DESC')
            ->get()->getResultArray();

        // 2. Ambil Checklist Checkout Hari Ini
        $today = date('Y-m-d');
        $todayChecklists = $db->table('attendances')
            ->select('user_id, users.name, checkout_checklist, time_out')
            ->join('users', 'users.id = attendances.user_id')
            ->where('attendance_date', $today)
            ->where('checkout_checklist IS NOT NULL')
            ->orderBy('time_out', 'DESC')
            ->get()->getResultArray();
---
SELECT `user_id`, `users`.`name`, COUNT(attendances.id) as total_attendance
FROM `attendances`
JOIN `users` ON `users`.`id` = `attendances`.`user_id`
GROUP BY `user_id`, `users`.`name`
ORDER BY `total_attendance` DESC
SELECT `user_id`, `users`.`name`, `checkout_checklist`, `time_out`
FROM `attendances`
JOIN `users` ON `users`.`id` = `attendances`.`user_id`
WHERE `attendance_date` = '2025-07-27'
AND `checkout_checklist` IS NOT NULL
ORDER BY `time_out` DESC