app/Controllers/api/Attendance.php

    public function checkin()
{
    $model = new AttendanceModel();
    $userId = $this->request->getVar('user_id');
    $today = date('Y-m-d');

    if (empty($userId)) {
        return $this->fail('User ID tidak boleh kosong.', 400);
    }

    $alreadyCheckedIn = $model->where('user_id', $userId)
                              ->where('attendance_date', $today)
                              ->first();
---
SELECT *
FROM `attendances`
WHERE `user_id` = '1'
AND `attendance_date` = '2025-07-24'
 LIMIT 1