app/Controllers/api/Attendance.php

    public function checkout(){
        $model = new AttendanceModel();
        $userId = $this->request->getVar('user_id');
        $latitude = $this->request->getVar('latitude');
        $longitude = $this->request->getVar('longitude');
        $photo = $this->request->getFile('photo_out');

        $attendanceData = $model->where('user_id', $userId)
                                ->where('attendance_date', date('Y-m-d'))
                                ->first();

        if (!$attendanceData) {
            return $this->failNotFound('Data Check In untuk hari ini tidak ditemukan. Silakan Check In terlebih dahulu.');
        }

        if (!$photo || !$photo->isValid() || $photo->hasMoved()) {
            return $this->fail($photo ? $photo->getErrorString() . '(' . $photo->getError() . ')' : 'File foto tidak ditemukan.');
        }

        $newName = $photo->getRandomName();
        $photo->move(FCPATH . 'uploads/attendances', $newName);

        $data = [
            'time_out'     => date('H:i:s'),
            'location_out' => "$latitude,$longitude",
            'photo_out'    => $newName,
        ];

        if ($model->update($attendanceData['id'], $data)) {
---
SELECT *
FROM `attendances`
WHERE `user_id` = '1'
AND `attendance_date` >= '2025-07-01'
AND `attendance_date` <= '2025-07-31'
ORDER BY `attendance_date` DESC
UPDATE `attendances` SET `time_out` = '12:41:06', `photo_out` = '1753335666_0f4e44f6bb29de28dd5d.jpg', `updated_at` = '2025-07-24 12:41:06'
WHERE `attendances`.`id` IN ('6')