app/Controllers/api/Auth.php

    public function login()
    {
        $model = new UserModel();

        // Ambil data dari body request
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // Cari pengguna berdasarkan email
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'andhika@gmail.com'
 LIMIT 1