app/Controllers/api/Users.php

    public function show($id = null){
    $model = new \App\Models\UserModel();
    $data = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '9'

public function uploadProfilePicture($id = null){
    $model = new \App\Models\UserModel();
    $user = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'